/*******************************************************************************
****版本：V1.0.0
****平台：STM8S003
****日期：2021-01-12
****作者：Qitas
****版权：OS-Q
*******************************************************************************/
#include <stddef.h>

#include "stm8s.h"
#include "timer4.h"

volatile uint8_t *_t4_timeoutp;

/*******************************************************************************
**函数信息 ：
**功能描述 ：
**输入参数 ：
**输出参数 ：
*******************************************************************************/
void timer4_init()
{
    disableInterrupts();
    TIM4->PSCR = 7;
    TIM4->IER |= TIM4_IER_UIE;
    TIM4->SR &= ~TIM4_SR1_UIF;
    // TIM4->SR &= 0xFE;
    enableInterrupts();
}

/*******************************************************************************
**函数信息 ：
**功能描述 ：
**输入参数 ：
**输出参数 ：
*******************************************************************************/
void timer4_start(uint8_t *timeoutp)
{
    // Enable timer 4
    _t4_timeoutp = timeoutp;
    TIM4->CR1 |= TIM4_CR1_CEN;
}

/*******************************************************************************
**函数信息 ：
**功能描述 ：
**输入参数 ：
**输出参数 ：
*******************************************************************************/
void timer4_stop()
{
    // disable t4
    TIM4->CR1 &= ~TIM4_CR1_CEN;
    _t4_timeoutp = NULL;
}
/*******************************************************************************
**函数信息 ：
**功能描述 ：
**输入参数 ：
**输出参数 ：
*******************************************************************************/
void timer4_isr(void) __interrupt(23)
{
    if (*_t4_timeoutp > 0)
    {
        (*_t4_timeoutp)--;
    } else
    {
        timer4_stop();
    }
    // Clear interrupt flag
    TIM4->SR &= ~TIM4_SR1_UIF;
    // Rewrite counter, calculated value is 125
    TIM4->CNTR = 0xFF - 125;
}

/*---------------------------(C) COPYRIGHT 2021 OS-Q -------------------------*/
